//  ---------------------------------------------------------------------------------------------------------------  //
//  parse-tools
//  ---------------------------------------------------------------------------------------------------------------  //

var pt = {};

//  ---------------------------------------------------------------------------------------------------------------  //

pt.makeArray = function(o) {
    return (o instanceof Array) ? o : [ o ];
};

//  ---------------------------------------------------------------------------------------------------------------  //

//  FIXME: Использовать эти две функции из runtime.
pt.quoteText = function(s) {
    if (s == null) { return ''; }
    s = s.toString(s);
    //  FIXME: Это кажется уже не нужно?
    //  s = s.replace(/&(?![A-Za-z#]\w+;)/g, '&amp;');
    s = s.replace(/&/g, '&amp;');
    s = s.replace(/</g, '&lt;');
    s = s.replace(/>/g, '&gt;');
    return s;
};

pt.quoteAttr = function(s) {
    if (s == null) { return ''; }
    s = s.toString(s);
    //  FIXME: Это кажется уже не нужно?
    //  s = s.replace(/&(?![A-Za-z#]\w+;)/g, '&amp;');
    s = s.replace(/&/g, '&amp;');
    s = s.replace(/</g, '&lt;');
    s = s.replace(/>/g, '&gt;');
    s = s.replace(/"/g, '&quot;');
    return s;
};

pt.quote = function(s) {
    return JSON.stringify(s);
};

//  ---------------------------------------------------------------------------------------------------------------  //

module.exports = pt;

//  ---------------------------------------------------------------------------------------------------------------  //

